app/Controllers/User/Auth.php

SELECT *
FROM `user`
WHERE `email` = 'wildanvinukananta@gmail.com'
 LIMIT 1
---
    public function auth()
    {
        $session = session();
        $model  =  new UserModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $user = $model->where('email', $email)->first();