app/Models/DetailTransaksiModel.php

UPDATE `detail_transaksi` SET `tanggal_pengembalian` = '2024-01-18', `total_denda` = 0, `total_bayar` = 1200000
WHERE `id_transaksi` = 'TRX20240117173501522'
---
    public function updateDetailTransaksi($data, $id)
    {
        return $this->db->table($this->table)->update($data, ['id_transaksi' => $id]);