app/Models/MerekModel.php

    public function getMerekActive()
    {
        return $this->where(['status' => 'Aktif'])->findAll();
---
SELECT *
FROM `merek`
WHERE `status` = 'Aktif'