app/Models/MobilModel.php

    public function getMobil($id = false)
    {
        if ($id == false) {
            return $this->db->table('mobil')
                ->select('merek.nama_merek, warna.warna, mobil.*')
                ->join('merek', 'merek.id_merek = mobil.id_merek')
                ->join('warna', 'warna.id_warna = mobil.id_warna')
                ->get()
                ->getResultArray();
        }
        return $this->db->table('mobil')
            ->select('merek.nama_merek, warna.warna, mobil.*')
            ->join('merek', 'merek.id_merek = mobil.id_merek')
            ->join('warna', 'warna.id_warna = mobil.id_warna')
            ->where(['id_mobil' => $id])
            ->get()
            ->getRowArray();
---
SELECT `merek`.`nama_merek`, `warna`.`warna`, `mobil`.*
FROM `mobil`
JOIN `merek` ON `merek`.`id_merek` = `mobil`.`id_merek`
JOIN `warna` ON `warna`.`id_warna` = `mobil`.`id_warna`
SELECT `merek`.`nama_merek`, `warna`.`warna`, `mobil`.*
FROM `mobil`
JOIN `merek` ON `merek`.`id_merek` = `mobil`.`id_merek`
JOIN `warna` ON `warna`.`id_warna` = `mobil`.`id_warna`
WHERE `id_mobil` = '3'

    public function getMobilActive()
    {
        return $this->db->table('mobil')
            ->select('merek.nama_merek, warna.warna, mobil.*')
            ->join('merek', 'merek.id_merek = mobil.id_merek')
            ->join('warna', 'warna.id_warna = mobil.id_warna')
            ->where(['mobil.status' => 'Aktif'])
            ->get()
            ->getResultArray();
---
SELECT `merek`.`nama_merek`, `warna`.`warna`, `mobil`.*
FROM `mobil`
JOIN `merek` ON `merek`.`id_merek` = `mobil`.`id_merek`
JOIN `warna` ON `warna`.`id_warna` = `mobil`.`id_warna`
WHERE `mobil`.`status` = 'Aktif'

    public function getCountMobil()
    {
        return $this->db->table('mobil')
            ->where(['mobil.status' => 'Aktif'])
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `mobil`
WHERE `mobil`.`status` = 'Aktif'

    public function updateMobil($data, $id)
    {
        return $this->db->table($this->table)->update($data, ['id_mobil' => $id]);
---
UPDATE `mobil` SET `tersedia` = 'Tersedia'
WHERE `id_mobil` = '4'