app/Models/RekeningModel.php

SELECT *
FROM `rekening`
---
    public function getRekening($id = false)
    {
        if ($id == false) {
            return $this->findAll();