app/Models/TransaksiModel.php

    public function getCountActiveTransaksi($id)
    {
        return $this->db->table('transaksi')
            ->join('detail_transaksi', 'detail_transaksi.id_transaksi = transaksi.id_transaksi')
            ->where(['transaksi.id_user' => $id])
            ->where(['transaksi.status' => 'Aktif'])
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
JOIN `detail_transaksi` ON `detail_transaksi`.`id_transaksi` = `transaksi`.`id_transaksi`
WHERE `transaksi`.`id_user` = '4'
AND `transaksi`.`status` = 'Aktif'

    public function updateTransaksi($data, $id)
    {
        return $this->db->table($this->table)->update($data, ['id_transaksi' => $id]);
---
UPDATE `transaksi` SET `status` = 'Selesai'
WHERE `id_transaksi` = 'TRX20240117173501522'