app/Models/TransaksiModel.php

    public function getTransaksi($id = false)
    {
        if ($id == false) {
            return $this->db->table('transaksi')
                ->select('user.nama, mobil.*, transaksi.id_user, transaksi.status as "status_transaksi", transaksi.created_at, detail_transaksi.*')
                ->join('user', 'user.id = transaksi.id_user')
                ->join('detail_transaksi', 'detail_transaksi.id_transaksi = transaksi.id_transaksi')
                ->join('mobil', 'mobil.id_mobil = detail_transaksi.id_mobil')
                ->orderBy('transaksi.created_at', 'DESC')
                ->get()
                ->getResultArray();
        }
        return $this->db->table('transaksi')
            ->select('user.nama, mobil.*, transaksi.id_user, transaksi.status as "status_transaksi", transaksi.created_at, detail_transaksi.*')
            ->join('user', 'user.id = transaksi.id_user')
            ->join('detail_transaksi', 'detail_transaksi.id_transaksi = transaksi.id_transaksi')
            ->join('mobil', 'mobil.id_mobil = detail_transaksi.id_mobil')
            ->where(['transaksi.id_user' => $id])
            ->orderBy('transaksi.created_at', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `user`.`nama`, `mobil`.*, `transaksi`.`id_user`, `transaksi`.`status` as "status_transaksi", `transaksi`.`created_at`, `detail_transaksi`.*
FROM `transaksi`
JOIN `user` ON `user`.`id` = `transaksi`.`id_user`
JOIN `detail_transaksi` ON `detail_transaksi`.`id_transaksi` = `transaksi`.`id_transaksi`
JOIN `mobil` ON `mobil`.`id_mobil` = `detail_transaksi`.`id_mobil`
ORDER BY `transaksi`.`created_at` DESC
SELECT `user`.`nama`, `mobil`.*, `transaksi`.`id_user`, `transaksi`.`status` as "status_transaksi", `transaksi`.`created_at`, `detail_transaksi`.*
FROM `transaksi`
JOIN `user` ON `user`.`id` = `transaksi`.`id_user`
JOIN `detail_transaksi` ON `detail_transaksi`.`id_transaksi` = `transaksi`.`id_transaksi`
JOIN `mobil` ON `mobil`.`id_mobil` = `detail_transaksi`.`id_mobil`
WHERE `transaksi`.`id_user` = '4'
ORDER BY `transaksi`.`created_at` DESC

    public function getTransaksiSelesai()
    {
        return $this->db->table('transaksi')
            ->select('user.nama, mobil.*, transaksi.id_user, transaksi.status as "status_transaksi", transaksi.created_at, detail_transaksi.*')
            ->join('user', 'user.id = transaksi.id_user')
            ->join('detail_transaksi', 'detail_transaksi.id_transaksi = transaksi.id_transaksi')
            ->join('mobil', 'mobil.id_mobil = detail_transaksi.id_mobil')
            ->where('transaksi.status', 'Selesai')
            ->orderBy('transaksi.created_at', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `user`.`nama`, `mobil`.*, `transaksi`.`id_user`, `transaksi`.`status` as "status_transaksi", `transaksi`.`created_at`, `detail_transaksi`.*
FROM `transaksi`
JOIN `user` ON `user`.`id` = `transaksi`.`id_user`
JOIN `detail_transaksi` ON `detail_transaksi`.`id_transaksi` = `transaksi`.`id_transaksi`
JOIN `mobil` ON `mobil`.`id_mobil` = `detail_transaksi`.`id_mobil`
WHERE `transaksi`.`id_transaksi` = 'TRX20240117173501522'

    public function getSumPendapatanTransaksi()
    {
        return $this->db->table('transaksi')
            ->select('SUM(detail_transaksi.total_bayar) as "total_transaksi"')
            ->join('detail_transaksi', 'detail_transaksi.id_transaksi = transaksi.id_transaksi')
            ->where('transaksi.status', 'Selesai')
            ->get()
            ->getRowArray();
---
SELECT `user`.`nama`, `mobil`.*, `transaksi`.`id_user`, `transaksi`.`status` as "status_transaksi", `transaksi`.`created_at`, `detail_transaksi`.*
FROM `transaksi`
JOIN `user` ON `user`.`id` = `transaksi`.`id_user`
JOIN `detail_transaksi` ON `detail_transaksi`.`id_transaksi` = `transaksi`.`id_transaksi`
JOIN `mobil` ON `mobil`.`id_mobil` = `detail_transaksi`.`id_mobil`
WHERE `transaksi`.`status` = 'Aktif'
SELECT SUM(detail_transaksi.total_bayar) as "total_transaksi"
FROM `transaksi`
JOIN `detail_transaksi` ON `detail_transaksi`.`id_transaksi` = `transaksi`.`id_transaksi`
WHERE `transaksi`.`status` = 'Selesai'

    public function getCountTransaksiSelesai()
    {
        return $this->db->table('transaksi')
            ->where('transaksi.status', 'Selesai')
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
WHERE `transaksi`.`status` = 'Selesai'

    public function getGrafikTransaksiSelesai()
    {
        return $this->select('MONTHNAME(created_at) as bulan, COUNT(id_transaksi) as jumlah')
            ->where('transaksi.status', 'Selesai')
            ->where('YEAR(created_at)', date('Y'))
            ->groupBy('MONTH(created_at)')
            ->orderBy('MONTH(created_at)', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT MONTHNAME(created_at) as bulan, COUNT(id_transaksi) as jumlah
FROM `transaksi`
WHERE `transaksi`.`status` = 'Selesai'
AND YEAR(created_at) = '2024'
GROUP BY MONTH(created_at)
ORDER BY MONTH(created_at) ASC

    public function getGrafikJumlahPendapatan()
    {
        return $this->select('MONTHNAME(created_at) as bulan, SUM(detail_transaksi.total_bayar) as jumlah')
            ->join('detail_transaksi', 'detail_transaksi.id_transaksi = transaksi.id_transaksi')
            ->where('transaksi.status', 'Selesai')
            ->where('YEAR(created_at)', date('Y'))
            ->groupBy('MONTH(created_at)')
            ->orderBy('MONTH(created_at)', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT MONTHNAME(created_at) as bulan, SUM(detail_transaksi.total_bayar) as jumlah
FROM `transaksi`
JOIN `detail_transaksi` ON `detail_transaksi`.`id_transaksi` = `transaksi`.`id_transaksi`
WHERE `transaksi`.`status` = 'Selesai'
AND YEAR(created_at) = '2024'
GROUP BY MONTH(created_at)
ORDER BY MONTH(created_at) ASC

    public function getCountActiveTransaksi($id = false)
    {
        if ($id == false) {
            return $this->db->table('transaksi')
                ->join('detail_transaksi', 'detail_transaksi.id_transaksi = transaksi.id_transaksi')
                ->where(['transaksi.status' => 'Aktif'])
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
JOIN `detail_transaksi` ON `detail_transaksi`.`id_transaksi` = `transaksi`.`id_transaksi`
WHERE `transaksi`.`status` = 'Aktif'