app/Models/WarnaModel.php

SELECT *
FROM `warna`
WHERE `status` = 'Aktif'
---
    public function getWarnaActive()
    {
        return $this->where(['status' => 'Aktif'])->findAll();